docs/zinb.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-01-14 Sun 17:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>ZINB estimation</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="site_libs/bootstrap-3.3.5/css/cosmo.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ZINB estimation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org470ab93">Introduction</a></li>
<li><a href="#org5a724da">Quality control</a></li>
<li><a href="#org8fd5c16">Read the data</a></li>
<li><a href="#orgde4b91c">Maximum likelihood estimation</a></li>
<li><a href="#org9aaf67c">Mean-QTL calling</a></li>
<li><a href="#orgad41e3e">Dispersion-QTL calling</a></li>
</ul>
</div>
</div>

<div id="outline-container-org470ab93" class="outline-2">
<h2 id="org470ab93">Introduction</h2>
<div class="outline-text-2" id="text-org470ab93">
<p>
The simplest approach to call mean/variance QTLs is to estimate a mean and a
dispersion for each individual, treat them as continuous phenotypes, and plug
into standard QTL mapping software.
</p>

<p>
Here, we find maximum likelihood estimates of a zero-inflated negative
binomial model for the dropout, mean, and dispersion per individual per gene.
</p>
</div>
</div>

<div id="outline-container-org5a724da" class="outline-2">
<h2 id="org5a724da">Quality control</h2>
<div class="outline-text-2" id="text-org5a724da">
<p>
Filter out cells on percent spike-in and gene detection rate, and filter out
genes on individual detection rate.
</p>

<div class="org-src-container">
<pre class="src src-ipython" id="org65b6f97"><span class="org-variable-name">keep_cells</span> = functools.<span class="org-builtin">reduce</span>(
  np.logical_and,
  [
    annotations[<span class="org-string">'reads_ercc'</span>] / annotations.<span class="org-builtin">filter</span>(like=<span class="org-string">'reads_'</span>, axis=1).agg(np.<span class="org-builtin">sum</span>, axis=1) &lt; 0.5,
    annotations[<span class="org-string">'detect_hs'</span>] &gt; 4000,
    annotations[<span class="org-string">'chip_id'</span>] != <span class="org-string">'NA19092'</span>,
  ]).values
<span class="org-variable-name">keep_genes</span> = functools.<span class="org-builtin">reduce</span>(
  np.logical_and,
  [
    (umi.groupby(annotations[<span class="org-string">'chip_id'</span>].values, axis=1).agg(np.<span class="org-builtin">sum</span>) &gt; 0).<span class="org-builtin">apply</span>(<span class="org-keyword">lambda</span> x: x.mean() &gt; 0.5, axis=1)
  ]).values
<span class="org-variable-name">umi_qc</span> = umi.loc[keep_genes, keep_cells]
<span class="org-variable-name">annotations_qc</span> = annotations.loc[keep_cells]
umi_qc.mask(umi_qc == 0)
umi_qc.shape
</pre>
</div>

<pre class="example">
(15636, 1810)

</pre>

<div class="org-src-container">
<pre class="src src-ipython" id="org1e8d763"><span class="org-variable-name">individuals</span> = <span class="org-builtin">sorted</span>(annotations_qc[<span class="org-string">'chip_id'</span>].unique())
<span class="org-variable-name">onehot</span> = np.zeros((umi_qc.shape[1], <span class="org-builtin">len</span>(individuals)), dtype=np.float32)
onehot[np.arange(onehot.shape[0]),annotations_qc[<span class="org-string">'chip_id'</span>].<span class="org-builtin">apply</span>(<span class="org-keyword">lambda</span> x: individuals.index(x))] = 1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">umi_qc.to_csv(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/umi-qc.txt.gz'</span>, sep=<span class="org-string">' '</span>, compression=<span class="org-string">'gzip'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">onehot</span> = pd.DataFrame(onehot, columns=individuals, index=umi_qc.columns)
onehot.to_csv(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/onehot-qc.txt.gz'</span>, sep=<span class="org-string">' '</span>, compression=<span class="org-string">'gzip'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fd5c16" class="outline-2">
<h2 id="org8fd5c16">Read the data</h2>
<div class="outline-text-2" id="text-org8fd5c16">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">umi</span> = pd.read_table(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/umi-qc.txt.gz'</span>, sep=<span class="org-string">' '</span>, index_col=0, nrows=4000)
<span class="org-variable-name">onehot</span> = pd.read_table(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/onehot-qc.txt.gz'</span>, sep=<span class="org-string">' '</span>, index_col=0)
</pre>
</div>
</div>
</div>
