analysis/zinb.org
* Maximum likelihood estimation

  Use gradient descent to maximize the likelihood of the zero-inflated negative
  binomial model for the data.

  \[ r_{ijk} = \text{number of reads for individual \(i\), cell \(j\), gene
  \(k\)} \]

  \[ r_{ijk} = \pi_j \delta_0(r_{ijk}) + (1 - \pi_j) \mathcal{NB}(r_{ijk};
  \mu_{ik}, \phi_{ik}) \]

  #+BEGIN_SRC ipython :tangle zinb.py
    def log_zinb_positive(x, mu, theta, pi, eps=1e-8):
      """Log likelihood of x according to ZINB model

      Lopez et al. "A deep generative model for gene expression profiles
      from single-cell RNA sequencing"

      c.f. Hilbe 2012, eq. 11.12, 11.13

      mu: mean (>0)
      theta: inverse dispersion parameter (>0)
      pi:logit of the dropout parameter

      """
      case_zero = tf.nn.softplus(- pi + theta * tf.log(theta + eps) - theta * tf.log(theta + mu + eps)) \
                  - tf.nn.softplus( - pi)
      case_non_zero = - pi - tf.nn.softplus(- pi) \
                      + theta * tf.log(theta + eps) - theta * tf.log(theta + mu + eps) \
                      + x * tf.log(mu + eps) - x * tf.log(theta + mu + eps) \
                      + tf.lgamma(x + theta) - tf.lgamma(theta) - tf.lgamma(x + 1)
      mask = tf.cast(tf.less(x, eps), tf.float32)
      res = tf.multiply(mask, case_zero) + tf.multiply(1 - mask, case_non_zero)
      return tf.reduce_sum(res)
      return tf.reduce_sum(tf.multiply(mask, case_zero) + tf.multiply(1 - mask, case_non_zero))

    def fit(umi, onehot, learning_rate=1e-2, max_epochs=1000):
      """Return estimated dropout log odds, log mean, and log dispersion

      umi - count matrix (n x p; float32)
      onehot - mapping of individuals to cells (m x n; float32)

      Returns:

      llik - log likelihood
      dropout - spike log odds (n x 1)
      log_mean - log mean parameter (m x p)
      log_disp - log dispersion parameter (m x p)

      """
      n, p = umi.shape
      _, m = onehot.shape

      umi = tf.Variable(umi, trainable=False)
      onehot = tf.Variable(onehot, trainable=False)

      index = tf.placeholder(tf.int32)

      dropout = tf.Variable(tf.zeros([n, 1]))
      mean = tf.exp(tf.Variable(tf.zeros([m, p])))
      dispersion = tf.exp(tf.Variable(tf.zeros([m, p])))

      llik = log_zinb_positive(
        umi,
        tf.matmul(onehot, mean),
        tf.matmul(onehot, dispersion),
        dropout)

      train = tf.train.RMSPropOptimizer(learning_rate=learning_rate).minimize(-llik)

      opt = [tf.log(mean), tf.log(dispersion), dropout]
      curr = float('-inf')
      with tf.Session() as sess:
        sess.run(tf.global_variables_initializer())
        for i in range(max_epochs):
          _, update = sess.run([train, llik], feed_dict={index: i % p})
          if not np.isfinite(update):
            raise tf.train.NanLossDuringTrainingError
          if not i % 100:
            print(i, update)
        return sess.run(opt)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython :tangle zinb.py
    mean, dispersion, dropout = fit(
      umi.values.T.astype(np.float32),
      onehot.values.astype(np.float32),
      learning_rate=1e-2)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython :tangle zinb.py
    pd.DataFrame(mean.T, index=umi.index, columns=onehot.columns).to_csv('/scratch/midway2/aksarkar/singlecell/mean.txt.gz', sep=' ', compression='gzip')
    pd.DataFrame(dispersion.T, index=umi.index, columns=onehot.columns).to_csv('/scratch/midway2/aksarkar/singlecell/dispersion.txt.gz', sep=' ', compression='gzip')
    pd.DataFrame(dropout, index=umi.columns).to_csv('/scratch/midway2/aksarkar/singlecell/dropout.txt.gz', sep=' ', compression='gzip')
  #+END_SRC

  This estimation problem takes too long to run interactively, so [[https://orgmode.org/manual/Extracting-source-code.html][tangle]] it
  from this file and run it through ~sbatch~.

  #+BEGIN_SRC emacs-lisp
    (org-babel-tangle)
  #+END_SRC

  #+BEGIN_SRC sh :eval never-export
    sbatch --partition=broadwl --mem=8G --time=120 --job-name=zinb --output=zinb.out --error=zinb.err
    #!/bin/bash
    source activate scqtl
    python zinb.py
  #+END_SRC

  #+RESULTS:
  : Submitted batch job 42072360

