docs/zinb.html

<div id="outline-container-orgde4b91c" class="outline-2">
<h2 id="orgde4b91c">Maximum likelihood estimation</h2>
<div class="outline-text-2" id="text-orgde4b91c">
<p>
Use gradient descent to maximize the likelihood of the zero-inflated negative
binomial model for the data.
</p>

<p>
\[ r_{ijk} = \text{number of reads for individual \(i\), cell \(j\), gene
  \(k\)} \]
</p>

<p>
\[ r_{ijk} = \pi_j \delta_0(r_{ijk}) + (1 - \pi_j) \mathcal{NB}(r_{ijk};
  \mu_{ik}, \phi_{ik}) \]
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">def</span> <span class="org-function-name">log_zinb_positive</span>(x, mu, theta, pi, eps=1e-8):
  <span class="org-doc">"""Log likelihood of x according to ZINB model</span>

<span class="org-doc">  Lopez et al. "A deep generative model for gene expression profiles</span>
<span class="org-doc">  from single-cell RNA sequencing"</span>

<span class="org-doc">  c.f. Hilbe 2012, eq. 11.12, 11.13</span>

<span class="org-doc">  mu: mean (&gt;0)</span>
<span class="org-doc">  theta: inverse dispersion parameter (&gt;0)</span>
<span class="org-doc">  pi:logit of the dropout parameter</span>

<span class="org-doc">  """</span>
  <span class="org-variable-name">case_zero</span> = tf.nn.softplus(-pi + theta * tf.log(theta + eps) - theta * tf.log(theta + mu + eps)) \
              - tf.nn.softplus(-pi)
  <span class="org-variable-name">case_non_zero</span> = - pi - tf.nn.softplus(- pi) \
                  + theta * tf.log(theta + eps) - theta * tf.log(theta + mu + eps) \
                  + x * tf.log(mu + eps) - x * tf.log(theta + mu + eps) \
                  + tf.lgamma(x + theta) - tf.lgamma(theta) - tf.lgamma(x + 1)
  <span class="org-variable-name">mask</span> = tf.cast(tf.less(x, eps), tf.float32)
  <span class="org-keyword">return</span> tf.reduce_sum(tf.multiply(mask, case_zero) + tf.multiply(1 - mask, case_non_zero))

<span class="org-keyword">def</span> <span class="org-function-name">fit</span>(umi, onehot, learning_rate=1e-2, max_epochs=1000):
  <span class="org-doc">"""Return estimated dropout log odds, log mean, and log dispersion</span>

<span class="org-doc">  umi - count matrix (n x p; float32)</span>
<span class="org-doc">  onehot - mapping of individuals to cells (m x n; float32)</span>

<span class="org-doc">  Returns:</span>

<span class="org-doc">  llik - log likelihood</span>
<span class="org-doc">  dropout - spike log odds (n x 1)</span>
<span class="org-doc">  log_mean - log mean parameter (m x p)</span>
<span class="org-doc">  log_disp - log dispersion parameter (m x p)</span>

<span class="org-doc">  """</span>
  <span class="org-variable-name">n</span>, <span class="org-variable-name">p</span> = umi.shape
  <span class="org-variable-name">_</span>, <span class="org-variable-name">m</span> = onehot.shape

  <span class="org-variable-name">umi</span> = tf.Variable(umi, trainable=<span class="org-constant">False</span>)
  <span class="org-variable-name">onehot</span> = tf.Variable(onehot, trainable=<span class="org-constant">False</span>)

  <span class="org-variable-name">index</span> = tf.placeholder(tf.int32)

  <span class="org-variable-name">dropout</span> = tf.Variable(tf.zeros([n, 1]))
  <span class="org-variable-name">mean</span> = tf.exp(tf.Variable(tf.zeros([m, p])))
  <span class="org-variable-name">dispersion</span> = tf.exp(tf.Variable(tf.zeros([m, p])))

  <span class="org-variable-name">llik</span> = log_zinb_positive(
    umi,
    tf.matmul(onehot, mean),
    tf.matmul(onehot, dispersion),
    dropout)

  <span class="org-variable-name">train</span> = tf.train.RMSPropOptimizer(learning_rate=learning_rate).minimize(-llik)

  <span class="org-variable-name">opt</span> = [tf.log(mean), tf.log(dispersion), dropout]
  <span class="org-variable-name">curr</span> = <span class="org-builtin">float</span>(<span class="org-string">'-inf'</span>)
  <span class="org-keyword">with</span> tf.Session() <span class="org-keyword">as</span> sess:
    sess.run(tf.global_variables_initializer())
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(max_epochs):
      <span class="org-variable-name">_</span>, <span class="org-variable-name">update</span> = sess.run([train, llik], feed_dict={index: i % p})
      <span class="org-keyword">if</span> <span class="org-keyword">not</span> np.isfinite(update):
        <span class="org-keyword">raise</span> tf.train.NanLossDuringTrainingError
      <span class="org-keyword">if</span> <span class="org-keyword">not</span> i % 100:
        <span class="org-keyword">print</span>(i, update)
    <span class="org-keyword">return</span> sess.run(opt)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">mean</span>, <span class="org-variable-name">dispersion</span>, <span class="org-variable-name">dropout</span> = fit(
  umi.values.T.astype(np.float32),
  onehot.values.astype(np.float32),
  learning_rate=1e-2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">pd.DataFrame(mean.T, index=umi.index, columns=onehot.columns).to_csv(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/mean.txt.gz'</span>, sep=<span class="org-string">' '</span>, compression=<span class="org-string">'gzip'</span>)
pd.DataFrame(dispersion.T, index=umi.index, columns=onehot.columns).to_csv(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/dispersion.txt.gz'</span>, sep=<span class="org-string">' '</span>, compression=<span class="org-string">'gzip'</span>)
pd.DataFrame(dropout, index=umi.columns).to_csv(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/dropout.txt.gz'</span>, sep=<span class="org-string">' '</span>, compression=<span class="org-string">'gzip'</span>)
</pre>
</div>

<p>
This estimation problem takes too long to run interactively, so <a href="https://orgmode.org/manual/Extracting-source-code.html">tangle</a> it
from this file and run it through <code>sbatch</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-tangle)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">sbatch --partition=broadwl --mem=8G --time=120 --job-name=zinb --output=zinb.out --error=zinb.err
<span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/bash</span>
<span class="org-builtin">source</span> activate scqtl
python zinb.py
</pre>
</div>
</div>
</div>
