analysis/zinb.org
* Mean-QTL calling

  Write out the [[https://qtltools.github.io/qtltools/pages/input_files.html][phenotype file]] for ~QTLtools~.

  #+NAME: get-gene-info
  #+BEGIN_SRC ipython
    gene_info = (pd.read_table('/home/aksarkar/projects/singlecell-qtl/data/scqtl-genes.txt.gz')
                 .set_index('gene')
                 .query('source == "H. sapiens"')
                 .query('chr != "hsX"')
                 .query('chr != "hsY"')
                 .query('chr != "hsMT"'))
    gene_info.head()
  #+END_SRC

  #+RESULTS: get-gene-info
  :RESULTS:
  #+BEGIN_EXAMPLE
                    chr      start        end      name strand      source
    gene                                                                    
    ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
    ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
    ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
    ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
    ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
  #+END_EXAMPLE
  :END:

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                    chr      start        end      name strand      source
    gene                                                                    
    ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
    ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
    ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
    ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
    ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
  #+END_EXAMPLE
  :END:

  #+NAME: write-pheno-def
  #+BEGIN_SRC ipython
    def qtltools_format(row):
      row['#Chr'] = 'chr{}'.format(row['chr'][2:])
      row['gid'] = row.name
      row['pid'] = row.name
      return row

    def write_pheno_file(pheno, gene_info, output_file):
      (gene_info
       .apply(qtltools_format, axis=1)
       .merge(pheno, left_index=True, right_index=True)
       .to_csv(output_file,
               sep='\t',
               columns=['#Chr', 'start', 'end', 'pid', 'gid', 'strand'] + list(pheno.columns),
               header=True,
               index=False,
               index_label=False)
      )
  #+END_SRC

  #+RESULTS: write-pheno-def
  :RESULTS:
  :END:

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    mean = pd.read_table('/scratch/midway2/aksarkar/singlecell/mean.txt.gz', sep=' ', index_col=0)
    mean.head()
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                    NA18489   NA18498   NA18499   NA18501   NA18502   NA18505  \
    gene                                                                          
    ENSG00000000003  2.132201  1.862085  1.994689  2.203277  1.994263  1.873698   
    ENSG00000000005 -1.304971 -1.137107 -2.085783 -1.440596 -2.309412 -1.127515   
    ENSG00000000419  1.408769  1.332950  1.690473  1.656058  1.669314  1.605577   
    ENSG00000000457 -0.993338 -2.940411 -0.788445 -0.932689 -0.906488 -0.360301   
    ENSG00000000460  0.403482 -0.106141  0.520277  0.567161  0.443905  0.670071   

                      NA18507   NA18508   NA18519   NA18520    ...      NA19119  \
    gene                                                       ...                
    ENSG00000000003  2.185227  1.984693  2.175263  1.960210    ...     2.228055   
    ENSG00000000005 -1.499075 -3.047421 -1.563732 -2.949254    ...    -2.113694   
    ENSG00000000419  1.834280  1.659502  1.692899  1.579187    ...     1.806168   
    ENSG00000000457 -0.763892 -0.913251 -1.235485 -0.913332    ...    -1.210785   
    ENSG00000000460  0.474492  0.521287  0.653763  0.439643    ...     0.771924   

                      NA19128   NA19153   NA19159   NA19190   NA19193   NA19203  \
    gene                                                                          
    ENSG00000000003  2.316742  2.286229  1.866834  2.146526  2.011522  1.547072   
    ENSG00000000005 -2.109344 -0.943781 -3.445312 -2.083898 -2.493103 -1.347846   
    ENSG00000000419  2.015950  1.903451  1.413075  1.730209  1.968157  1.188535   
    ENSG00000000457 -0.705963 -0.792029 -0.870194 -0.492704 -1.142365 -2.031550   
    ENSG00000000460  0.898602  0.601947  0.173087  0.454041  0.562179  0.153599   

                      NA19207   NA19210   NA19257  
    gene                                           
    ENSG00000000003  2.275138  2.277549  2.068974  
    ENSG00000000005 -1.550304 -1.269496 -2.731949  
    ENSG00000000419  1.865725  2.116240  2.024805  
    ENSG00000000457 -0.965920 -0.678640 -0.859062  
    ENSG00000000460  0.797515  0.873859  0.751235  

    [5 rows x 32 columns]
  #+END_EXAMPLE
  :END:

  #+BEGIN_SRC ipython
    write_pheno_file(mean, gene_info, '/scratch/midway2/aksarkar/singlecell/mean.bed')
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  Index the phenotype file.

  #+NAME: tabix
  #+BEGIN_SRC sh :var input="mean.bed" :var partition="broadwl" :dir /scratch/midway2/aksarkar/singlecell :eval never-export
    export input=$input
    sbatch --partition=$partition --wait
    #!/bin/bash
    sort -k1,1 -k2,2n -k3,3n $input | bgzip >$input.gz
    tabix -p bed $input.gz
  #+END_SRC

  #+RESULTS: tabix
  : Submitted batch job 42125468

  Run the QTL mapping.

  #+NAME: qtltools
  #+BEGIN_SRC sh :var pheno="mean" :var partition="broadwl" :dir /scratch/midway2/aksarkar/singlecell :eval never-export 
    export pheno=$pheno
    sbatch --partition=$partition -N1 -c4 -J $pheno-qtl -o $pheno-qtl.log
    #!/bin/bash
    source activate scqtl
    module load parallel
    parallel -j4 qtltools cis --vcf /project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz --bed $pheno.bed.gz --nominal=0.01 --chunk {#} 100 --out $pheno-qtl.{#}.txt ::: $(seq 1 100)
  #+END_SRC

  #+RESULTS: qtltools
  : Submitted batch job 42125616

  Read the results.

  #+BEGIN_SRC ipython
    file_names = ['mean-qtl.{}.txt'.format(i) for i in range(1, 101)]
    mean_qtls = (pd.concat([pd.read_table(f, header=None, sep=' ') for f in file_names if os.path.exists(f) and os.path.getsize(f) > 0])
                 .rename(columns={i: x for i, x in enumerate(['gene', 'chr', 'start', 'end', 'strand', 'num_vars', 'distance', 'id', 'var_chr', 'var_start', 'var_end', 'p', 'beta', 'top'])})
                 .sort_values('p')
                 .set_index('gene'))
    mean_qtls[mean_qtls['top'] == 1].head()
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                     chr   start     end strand  num_vars  distance id var_chr  \
    gene                                                                           
    ENSG00000239857   chr7  916190  936073      +      7763   -916190  C    chr7   
    ENSG00000169026   chr4  675619  683230      -      4952    675619  C    chr4   
    ENSG00000101282  chr20  939096  982907      -      6734    939096  G   chr20   
    ENSG00000186777   chr4  264465  299110      -      3531    264465  A    chr4   
    ENSG00000116014  chr19  917288  921015      +      6659   -917288  G   chr19   

                     var_start  var_end             p     beta  top  
    gene                                                             
    ENSG00000239857     986498        0  1.273710e-16 -4.71915    1  
    ENSG00000169026     810152        0  2.231630e-15 -4.74142    1  
    ENSG00000101282    1025679        0  3.021520e-15 -5.27573    1  
    ENSG00000186777     897103        0  4.407960e-15 -4.66579    1  
    ENSG00000116014     619338        0  1.081230e-14 -5.08811    1  
  #+END_EXAMPLE
  :END:

  *TODO:* Permutation testing within QTLtools? lfsr estimation by ~ashr~?

