docs/zinb.html

<div id="outline-container-org9aaf67c" class="outline-2">
<h2 id="org9aaf67c">Mean-QTL calling</h2>
<div class="outline-text-2" id="text-org9aaf67c">
<p>
Write out the <a href="https://qtltools.github.io/qtltools/pages/input_files.html">phenotype file</a> for <code>QTLtools</code>.
</p>

<div class="org-src-container">
<pre class="src src-ipython" id="org389e5be"><span class="org-variable-name">gene_info</span> = (pd.read_table(<span class="org-string">'/home/aksarkar/projects/singlecell-qtl/data/scqtl-genes.txt.gz'</span>)
             .set_index(<span class="org-string">'gene'</span>)
             .query(<span class="org-string">'source == "H. sapiens"'</span>)
             .query(<span class="org-string">'chr != "hsX"'</span>)
             .query(<span class="org-string">'chr != "hsY"'</span>)
             .query(<span class="org-string">'chr != "hsMT"'</span>))
gene_info.head()
</pre>
</div>

<pre class="example">
                chr      start        end      name strand      source
gene                                                                    
ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
</pre>

<pre class="example">
                chr      start        end      name strand      source
gene                                                                    
ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
</pre>

<div class="org-src-container">
<pre class="src src-ipython" id="org5a26fff"><span class="org-keyword">def</span> <span class="org-function-name">qtltools_format</span>(row):
  <span class="org-variable-name">row</span>[<span class="org-string">'#Chr'</span>] = <span class="org-string">'chr{}'</span>.<span class="org-builtin">format</span>(row[<span class="org-string">'chr'</span>][2:])
  <span class="org-variable-name">row</span>[<span class="org-string">'gid'</span>] = row.name
  <span class="org-variable-name">row</span>[<span class="org-string">'pid'</span>] = row.name
  <span class="org-keyword">return</span> row

<span class="org-keyword">def</span> <span class="org-function-name">write_pheno_file</span>(pheno, gene_info, output_file):
  (gene_info
   .<span class="org-builtin">apply</span>(qtltools_format, axis=1)
   .merge(pheno, left_index=<span class="org-constant">True</span>, right_index=<span class="org-constant">True</span>)
   .to_csv(output_file,
           sep=<span class="org-string">'\t'</span>,
           columns=[<span class="org-string">'#Chr'</span>, <span class="org-string">'start'</span>, <span class="org-string">'end'</span>, <span class="org-string">'pid'</span>, <span class="org-string">'gid'</span>, <span class="org-string">'strand'</span>] + <span class="org-builtin">list</span>(pheno.columns),
           header=<span class="org-constant">True</span>,
           index=<span class="org-constant">False</span>,
           index_label=<span class="org-constant">False</span>)
  )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">mean</span> = pd.read_table(<span class="org-string">'/scratch/midway2/aksarkar/singlecell/mean.txt.gz'</span>, sep=<span class="org-string">' '</span>, index_col=0)
mean.head()
</pre>
</div>

<pre class="example">
                NA18489   NA18498   NA18499   NA18501   NA18502   NA18505  \
gene                                                                          
ENSG00000000003  2.132201  1.862085  1.994689  2.203277  1.994263  1.873698   
ENSG00000000005 -1.304971 -1.137107 -2.085783 -1.440596 -2.309412 -1.127515   
ENSG00000000419  1.408769  1.332950  1.690473  1.656058  1.669314  1.605577   
ENSG00000000457 -0.993338 -2.940411 -0.788445 -0.932689 -0.906488 -0.360301   
ENSG00000000460  0.403482 -0.106141  0.520277  0.567161  0.443905  0.670071   

                  NA18507   NA18508   NA18519   NA18520    ...      NA19119  \
gene                                                       ...                
ENSG00000000003  2.185227  1.984693  2.175263  1.960210    ...     2.228055   
ENSG00000000005 -1.499075 -3.047421 -1.563732 -2.949254    ...    -2.113694   
ENSG00000000419  1.834280  1.659502  1.692899  1.579187    ...     1.806168   
ENSG00000000457 -0.763892 -0.913251 -1.235485 -0.913332    ...    -1.210785   
ENSG00000000460  0.474492  0.521287  0.653763  0.439643    ...     0.771924   

                  NA19128   NA19153   NA19159   NA19190   NA19193   NA19203  \
gene                                                                          
ENSG00000000003  2.316742  2.286229  1.866834  2.146526  2.011522  1.547072   
ENSG00000000005 -2.109344 -0.943781 -3.445312 -2.083898 -2.493103 -1.347846   
ENSG00000000419  2.015950  1.903451  1.413075  1.730209  1.968157  1.188535   
ENSG00000000457 -0.705963 -0.792029 -0.870194 -0.492704 -1.142365 -2.031550   
ENSG00000000460  0.898602  0.601947  0.173087  0.454041  0.562179  0.153599   

                  NA19207   NA19210   NA19257  
gene                                           
ENSG00000000003  2.275138  2.277549  2.068974  
ENSG00000000005 -1.550304 -1.269496 -2.731949  
ENSG00000000419  1.865725  2.116240  2.024805  
ENSG00000000457 -0.965920 -0.678640 -0.859062  
ENSG00000000460  0.797515  0.873859  0.751235  

[5 rows x 32 columns]
</pre>

<div class="org-src-container">
<pre class="src src-ipython">write_pheno_file(mean, gene_info, <span class="org-string">'/scratch/midway2/aksarkar/singlecell/mean.bed'</span>)
</pre>
</div>

<p>
Index the phenotype file.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org78fe142"><span class="org-builtin">export</span> <span class="org-variable-name">input</span>=$<span class="org-variable-name">input</span>
sbatch --partition=$<span class="org-variable-name">partition</span> --wait
<span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/bash</span>
sort -k1,1 -k2,2n -k3,3n $<span class="org-variable-name">input</span> | bgzip &gt;$<span class="org-variable-name">input</span>.gz
tabix -p bed $<span class="org-variable-name">input</span>.gz
</pre>
</div>

<p>
Run the QTL mapping.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org93dc535"><span class="org-builtin">export</span> <span class="org-variable-name">pheno</span>=$<span class="org-variable-name">pheno</span>
sbatch --partition=$<span class="org-variable-name">partition</span> -N1 -c4 -J $<span class="org-variable-name">pheno</span>-qtl -o $<span class="org-variable-name">pheno</span>-qtl.log
<span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/bash</span>
<span class="org-builtin">source</span> activate scqtl
module load parallel
parallel -j4 qtltools cis --vcf /project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz --bed $<span class="org-variable-name">pheno</span>.bed.gz --nominal=0.01 --chunk {#} 100 --out $<span class="org-variable-name">pheno</span>-qtl.{#}.txt ::: $(<span class="org-sh-quoted-exec">seq</span> 1 100)
</pre>
</div>

<p>
Read the results.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">file_names</span> = [<span class="org-string">'mean-qtl.{}.txt'</span>.<span class="org-builtin">format</span>(i) <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1, 101)]
<span class="org-variable-name">mean_qtls</span> = (pd.concat([pd.read_table(f, header=<span class="org-constant">None</span>, sep=<span class="org-string">' '</span>) <span class="org-keyword">for</span> f <span class="org-keyword">in</span> file_names <span class="org-keyword">if</span> os.path.exists(f) <span class="org-keyword">and</span> os.path.getsize(f) &gt; 0])
             .rename(columns={i: x <span class="org-keyword">for</span> i, x <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>([<span class="org-string">'gene'</span>, <span class="org-string">'chr'</span>, <span class="org-string">'start'</span>, <span class="org-string">'end'</span>, <span class="org-string">'strand'</span>, <span class="org-string">'num_vars'</span>, <span class="org-string">'distance'</span>, <span class="org-string">'id'</span>, <span class="org-string">'var_chr'</span>, <span class="org-string">'var_start'</span>, <span class="org-string">'var_end'</span>, <span class="org-string">'p'</span>, <span class="org-string">'beta'</span>, <span class="org-string">'top'</span>])})
             .sort_values(<span class="org-string">'p'</span>)
             .set_index(<span class="org-string">'gene'</span>))
mean_qtls[mean_qtls[<span class="org-string">'top'</span>] == 1].head()
</pre>
</div>

<pre class="example">
                 chr   start     end strand  num_vars  distance id var_chr  \
gene                                                                           
ENSG00000239857   chr7  916190  936073      +      7763   -916190  C    chr7   
ENSG00000169026   chr4  675619  683230      -      4952    675619  C    chr4   
ENSG00000101282  chr20  939096  982907      -      6734    939096  G   chr20   
ENSG00000186777   chr4  264465  299110      -      3531    264465  A    chr4   
ENSG00000116014  chr19  917288  921015      +      6659   -917288  G   chr19   

                 var_start  var_end             p     beta  top  
gene                                                             
ENSG00000239857     986498        0  1.273710e-16 -4.71915    1  
ENSG00000169026     810152        0  2.231630e-15 -4.74142    1  
ENSG00000101282    1025679        0  3.021520e-15 -5.27573    1  
ENSG00000186777     897103        0  4.407960e-15 -4.66579    1  
ENSG00000116014     619338        0  1.081230e-14 -5.08811    1  
</pre>

<p>
<b>TODO:</b> Permutation testing within QTLtools? lfsr estimation by <code>ashr</code>?
</p>
</div>
</div>
