analysis/zinb.org
* Dispersion-QTL calling

  #+BEGIN_SRC ipython
    disp = pd.read_table('/scratch/midway2/aksarkar/singlecell/dispersion.txt.gz', sep=' ', index_col=0)
    disp.head()
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                    NA18489   NA18498   NA18499   NA18501   NA18502   NA18505  \
    gene                                                                          
    ENSG00000000003  1.092216  1.349166  1.376199  1.151147  1.597304  1.619764   
    ENSG00000000005  1.245627  7.247635 -0.062590  1.342859 -1.007912  0.411424   
    ENSG00000000419  1.913491  2.318849  1.598213  1.189439  1.753222  2.410088   
    ENSG00000000457 -0.699626  5.044208  0.099977 -0.107983 -0.469346  4.960834   
    ENSG00000000460  1.130231  6.989872  1.317161  1.452350  0.750685  7.235482   

                      NA18507   NA18508   NA18519   NA18520    ...      NA19119  \
    gene                                                       ...                
    ENSG00000000003  1.129030  1.115463  1.833903  1.555660    ...     1.315700   
    ENSG00000000005 -0.469625  4.921400 -0.688780  5.141915    ...     6.322920   
    ENSG00000000419  1.036118  0.865517  1.408871  1.298325    ...     3.754308   
    ENSG00000000457 -0.108463  0.456174 -0.609740 -0.225618    ...     0.740946   
    ENSG00000000460  0.996670  0.676970  2.453142  1.251912    ...     0.717296   

                      NA19128   NA19153   NA19159   NA19190   NA19193   NA19203  \
    gene                                                                          
    ENSG00000000003  0.693213  1.513592  1.016362  1.539210  1.417464  1.459843   
    ENSG00000000005 -0.657682 -0.084881  4.429851  0.978749  5.818314  0.995584   
    ENSG00000000419  0.771990  1.453221  1.603899  1.464751  1.067739  4.966578   
    ENSG00000000457 -0.268748  0.060874 -0.039906  0.009648  0.003913  6.323813   
    ENSG00000000460  0.866060  0.424351  7.455638  0.493674  1.032298  0.203354   

                      NA19207   NA19210   NA19257  
    gene                                           
    ENSG00000000003  1.296685  1.494707  1.368400  
    ENSG00000000005  0.493389 -1.198948  5.263945  
    ENSG00000000419  1.536127  1.775915  1.279451  
    ENSG00000000457 -0.081436  0.800806 -0.193967  
    ENSG00000000460  1.145072  1.669772  1.276706  

    [5 rows x 32 columns]
  #+END_EXAMPLE
  :END:

  #+BEGIN_SRC ipython
    write_pheno_file(disp, gene_info, '/scratch/midway2/aksarkar/singlecell/disp.bed')
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  Index the phenotype file

  #+CALL: tabix(input="disp.bed")

  #+RESULTS:
  : Submitted batch job 42125661

  Run ~qtltools~

  #+CALL: qtltools(pheno="disp")

  #+RESULTS:
  : Submitted batch job 42125670

  There are no detected dispersion QTLs, so the following code raises an exception.

  #+BEGIN_SRC ipython
    file_names = ['disp-qtl.{}.txt'.format(i) for i in range(1, 101)]
    disp_qtls = (pd.concat([pd.read_table(f, header=None, sep=' ') for f in file_names if os.path.exists(f) and os.path.getsize(f) > 0])
                 .rename(columns={i: x for i, x in enumerate(['gene', 'chr', 'start', 'end', 'strand', 'num_vars', 'distance', 'id', 'var_chr', 'var_start', 'var_end', 'p', 'beta', 'top'])})
                 .sort_values('p')
                 .set_index('gene'))
    disp_qtls[disp_qtls['top'] == 1].head()
  #+END_SRC
